# Створіть масив зі строками, які будуть складатися з чисел, які розділені комою. Наприклад:
#
# [”1,2,3,4”, ”1,2,3,4,50”, ”qwerty1,2,3”]
#
# Для кожного елементу списку виведіть суму всіх чисел (створіть нову функцію для цього).
#
# Якщо є символи, що не є числами (”qwerty1,2,3” у прикладі), вам потрібно зловити вийняток і вивести “Не можу це зробити!”
#
# Використовуйте блок try\except, щоб уникнути інших символів, окрім чисел у списку.
#
# Для цього прикладу правильний вивід буде - 10, 60, “Не можу це зробити”

list1 = ["1,2,3,4", "1,2,3,4,50", "qwerty1,2,3"]


def sum_all_numbers(numbers):
    for number in numbers:
        try:
            split_number = [int(x) for x in number.split(",")]
            print(sum(split_number))
        except ValueError as e:
            print(f"Не можу це зробити!: {e}")
            break


sum_all_numbers(list1)
